tap "jmhobbs/tools"
tap "ms-jpq/sad"
tap "mike-engel/jwt-cli"

cask "font-hack-nerd-font"
cask "font-martian-mono"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"

if OS.mac?
    brew "pinentry-mac"

    cask "alacritty"
    cask "alfred"
    cask "bartender"
    cask "caffeine"
    cask "calibre"
    cask "cameracontroller"
    cask "charles"
    cask "choosy"
    cask "free-ruler"
    cask "gas-mask"
    cask "ghostty"
    cask "gimp"
    cask "google-cloud-sdk"
    cask "handbrake"
    cask "iina"
    cask "iterm2"
    cask "itsycal"
    cask "karabiner-elements"
    cask "keycastr"
    cask "kitty"
    cask "librewolf"
    cask "licecap"
    cask "macfuse"
    cask "ngrok"
    cask "orbstack"
    cask "qlmarkdown"
    cask "rar"
    cask "rectangle"
    cask "stats"
    cask "transmission"
    cask "visual-studio-code"
    cask "vlc"
    cask "wireshark"
    cask "xquartz"
end

brew "asciinema"
brew "asdf"
brew "aws-sso-cli"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bats-core"
brew "curl"
brew "delve"
brew "difftastic"
brew "direnv"
brew "docker-credential-helper-ecr"
brew "editorconfig"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "glow"
brew "pinentry"
brew "gnupg"
brew "golangci-lint"
brew "hadolint"
brew "hexyl"
brew "jq"
brew "imagemagick"
brew "libpq"
brew "mockery"
brew "mongosh"
brew "ncdu"
brew "neovim"
brew "netcat"
brew "nmap"
brew "tmux"
brew "overmind"
brew "pstree"
brew "pwgen"
brew "redis", restart_service: :changed
brew "rename"
brew "restic"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "sad"
brew "shellcheck"
brew "tailscale"
brew "tcl-tk"
brew "telnet"
brew "terraform"
brew "tflint"
brew "trash", link: true
brew "tree"
brew "watch"
brew "wget"
brew "wgo"
brew "wmctrl"
brew "ykman"
brew "zig"
brew "zip"
brew "zopfli"
brew "jmhobbs/tools/ansi-html"
brew "jmhobbs/tools/packet-diagram"
brew "jmhobbs/tools/srv"
brew "mike-engel/jwt-cli/jwt-cli"
