if OS.mac?
	tap "homebrew/cask"
	tap "homebrew/cask-fonts"

	brew "svn" # required for the fonts
	cask "font-source-code-pro-for-powerline"
	cask "font-source-code-pro"

	cask "alacritty"
	cask "alfred"
	cask "anybar"
	cask "bartender"
	cask "caffeine"
	cask "charles"
	cask "docker"
	cask "firefox"
	cask "google-chrome"
	cask "gpg-suite"
	cask "iterm2"
	cask "karabiner-elements"
	cask "keybase"
	cask "licecap"
	cask "ngrok"
	cask "obsidian"
	cask "rectangle"
	cask "visual-studio-code"
end

brew "asdf"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "curl"
brew "direnv"
brew "editorconfig"
brew "fzf"
brew "git"
brew "git-extras"
brew "gnupg"
brew "hexyl"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "most"
brew "netcat"
brew "node"
brew "nvim"
brew "openjpeg"
brew "openssl"
brew "pinentry"
brew "pstree"
brew "pwgen"
brew "rar"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "zip"
brew "zopfli"
