if OS.mac?
	tap "homebrew/cask"
	tap "homebrew/cask-fonts"

	brew "svn" # required for the fonts
	cask "font-source-code-pro-for-powerline"
	cask "font-source-code-pro"

	cask "alfred"
	cask "anybar"
	cask "bartender"
	cask "caffeine"
	cask "charles"
	cask "choosy"
	cask "docker"
	cask "firefox"
	cask "gas-mask"
	cask "google-chrome"
	cask "google-cloud-sdk"
	cask "gpg-suite"
	cask "handbrake"
	cask "iina"
	cask "iterm2"
	cask "karabiner-elements"
	cask "keybase"
	cask "kitty"
	cask "licecap"
	cask "ngrok"
	cask "qlmarkdown"
	cask "rar"
	cask "rectangle"
	cask "visual-studio-code"
	cask "wireshark"
end

brew "asdf"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "brotli"
brew "coreutils"
brew "curl"
brew "direnv"
brew "editorconfig"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "hadolint"
brew "heroku"
brew "hexyl"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "memcached"
brew "most"
brew "neovim"
brew "netcat"
brew "nmap"
brew "node"
brew "openjpeg"
brew "openssl"
brew "overmind"
brew "pinentry"
if OS.mac?
	brew "pinentry-mac"
end
brew "pstree"
brew "pwgen"
brew "rar"
brew "readline"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "shellcheck"
brew "telnet"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "zip"
brew "zopfli"
